### Project 3 Part 3
- Sarah Musselwhite
- 10/27/22

In [1]:
# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import pymysql
pymysql.install_as_MySQLdb()

# Additional Imports
import os, json, math, time
from yelpapi import YelpAPI
from tqdm.notebook import tqdm_notebook

In [2]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama
...,...,...,...,...,...,...,...,...,...
82974,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama
82975,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy"
82976,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller"
82978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History"

In [3]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
82974,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
82975,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
82976,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
82978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [4]:
genres_split = basics['genres'].str.split(",")

# explode the series and take the unique entries only
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Musical', 'Action', 'Adventure', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [5]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
82978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
82978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [6]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [7]:
# saving just the tconst and genres as a new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [8]:
# make a dictionary with list of unique genres as key and new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})

genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [10]:
basics_sql = basics.copy()
basics_sql

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
82974,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
82975,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
82976,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
82977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
82978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [11]:
basics_sql = basics_sql.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'])

In [12]:
basics_sql.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

In [13]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1918
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       797

In [14]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2008.0,PG

In [15]:
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

## Creating a Database

In [16]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine, inspect
from sqlalchemy_utils import create_database, database_exists
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [17]:
engine = create_engine(connection_str)

In [18]:
database_exists(connection_str)

True

In [19]:
basics_sql.to_sql('title_basics', engine, if_exists = 'replace')

82979

In [20]:
title_ratings.to_sql('title_ratings', engine, if_exists = 'replace')

471972

In [21]:
title_genres.to_sql('title_genres', engine, if_exists = 'replace')

155048

In [22]:
genre_lookup.to_sql('genres', engine, if_exists = 'replace')

26

In [23]:
tmdb_data.to_sql('tmdb_data', engine, if_exists = 'replace')

2501

In [24]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [25]:
q = """SELECT *
from genres
limit 5;

"""
pd.read_sql(q, engine)

   index Genre_Name  Genre_ID
0      0     Action         0
1      1      Adult         1
2      2  Adventure         2
3      3  Animation         3
4      4  Biography         4

In [26]:
q = """SELECT *
from title_basics
limit 5;

"""
pd.read_sql(q, engine)

,index,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,0,tt0035423,Kate & Leopold,2001.0,None,118
1,1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,3,tt0088751,The Naked Monster,2005.0,None,100
4,4,tt0096056,Crime and Punishment,2002.0,None,126

In [27]:
q = """SELECT *
from title_genres
limit 5;

"""
pd.read_sql(q, engine)

   index     tconst genres_split
0      0  tt0035423       Comedy
1      0  tt0035423      Fantasy
2      0  tt0035423      Romance
3      1  tt0062336        Drama
4      2  tt0069049        Drama

In [28]:
q = """SELECT *
from title_ratings
limit 5;

"""
pd.read_sql(q, engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1918
1      1  tt0000002            5.8       260
2      2  tt0000005            6.2      2541
3      3  tt0000006            5.1       175
4      4  tt0000007            5.4       797

In [29]:
q = """SELECT *
from tmdb_data
limit 5;

"""
pd.read_sql(q, engine)

   index    imdb_id     revenue      budget certification
0      0          0         NaN         NaN          None
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694  12854953.0    150000.0            PG

In [40]:
# Query the tables
display(pd.read_sql("SELECT * FROM title_basics;", engine),
        pd.read_sql("SELECT * FROM title_ratings;", engine),
        pd.read_sql("SELECT * FROM tmdb_data;", engine))

,index,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,0,tt0035423,Kate & Leopold,2001.0,None,118
1,1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,3,tt0088751,The Naked Monster,2005.0,None,100
4,4,tt0096056,Crime and Punishment,2002.0,None,126
...,...,...,...,...,...,...
82974,82974,tt9914942,Life Without Sara Amat,2019.0,None,74
82975,82975,tt9915872,The Last White Witch,2019.0,None,97
82976,82976,tt9916170,The Rehearsal,2019.0,None,51
82977,82977,tt9916190,Safeguard,2020.0,None,95
82978,82978,tt9916362,Coven,2020.0,None,92

         index     tconst  averageRating  numVotes
0            0  tt0000001            5.7      1918
1            1  tt0000002            5.8       260
2            2  tt0000005            6.2      2541
3            3  tt0000006            5.1       175
4            4  tt0000007            5.4       797
...        ...        ...            ...       ...
471967  471967  tt9916204            8.2       245
471968  471968  tt9916348            8.5        17
471969  471969  tt9916362            6.4      4919
471970  471970  tt9916428            3.8        14
471971  471971  tt9916720            5.3       269

[471972 rows x 4 columns]

      index    imdb_id     revenue      budget certification
0         0          0         NaN         NaN          None
1         1  tt0113026         0.0  10000000.0          None
2         2  tt0113092         0.0         0.0          None
3         3  tt0116391         0.0         0.0          None
4         4  tt0118694  12854953.0    150000.0            PG
...     ...        ...         ...         ...           ...
2496   2496  tt7797670         0.0         0.0          None
2497   2497  tt7797790         0.0         0.0          None
2498   2498  tt8665056         0.0         0.0          None
2499   2499  tt8795764         0.0         0.0            NR
2500   2500  tt9071078         0.0         0.0          None

[2501 rows x 5 columns]

In [39]:
# Show the tables
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data